CD2DTextLayout.#ctor(CRenderTarget*,ATL.CStringT&lt;System.Char,StrTraitMFC_DLL&lt;System.Char&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,CD2DTextFormat*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,CD2DSizeF!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32)
Constructs a CD2DTextLayout object.
pParentTarget: A pointer to the render target.
strText: A CString object that contains the string to create a new CD2DTextLayout object from.
textFormat: A CString object that contains the format to apply to the string.
sizeMax: The size of the layout box.
bAutoDestroy: Indicates that the object will be destroyed by owner (pParentTarget).